In [39]:
import redis
import pandas as pd
import numpy as np

In [3]:
r = redis.Redis(
  host='127.0.0.1',
  port=6379)

In [6]:
r.set('film:1:name', 'Drive')
r.set('film:2:name', 'Demolition')
r.set('film:3:name', 'Clerks')
r.set('film:4:name', 'Dogma')
r.set('film:5:name', 'Baby Driver')
r.set('film:6:name', 'Harry Potter and the Sorcerers Stone')
r.set('film:7:name', 'Inception')
r.set('film:8:name', 'Snatch')
r.set('film:9:name', 'Home Alone')
r.set('film:10:name', 'Back to the Future')

r.set('film:1:year', 2011)
r.set('film:2:year', 2015)
r.set('film:3:year', 1994)
r.set('film:4:year', 1999)
r.set('film:5:year', 2017)
r.set('film:6:year', 2001)
r.set('film:7:year', 2010)
r.set('film:8:year', 2000)
r.set('film:9:year', 1990)
r.set('film:10:year', 1985)

r.set('film:1:rate', 7.3)
r.set('film:2:rate', 7.2)
r.set('film:3:rate', 7.7)
r.set('film:4:rate', 7.7)
r.set('film:5:rate', 7.2)
r.set('film:6:rate', 8.7)
r.set('film:7:rate', 8.7)
r.set('film:8:rate', 8.5)
r.set('film:9:rate', 8.3)
r.set('film:10:rate', 8.6)

r.set('film:1:country', 'USA')
r.set('film:2:country', 'USA')
r.set('film:3:country', 'USA')
r.set('film:4:country', 'USA')
r.set('film:5:country', 'USA')
r.set('film:6:country', 'USA')
r.set('film:7:country', 'USA')
r.set('film:8:country', 'USA')
r.set('film:9:country', 'USA')
r.set('film:10:country', 'USA')

r.set('film:1:cash', 15000000)
r.set('film:2:cash', 10000000)
r.set('film:3:cash', 27000)
r.set('film:4:cash', 10000000)
r.set('film:5:cash', 34000000)
r.set('film:6:cash', 125000000)
r.set('film:7:cash', 160000000)
r.set('film:8:cash', 10000000)
r.set('film:9:cash', 18000000)
r.set('film:10:cash', 19000000)

True

### **1. Вывести отсортированный список фильмов по годам (возрастанию) и бюджету (убывание)**

In [24]:
film_keys = r.keys('film:*:name')
names = []
years = []
cashs = []
rates = []

for key in film_keys:
    film_id = key.decode().split(':')[1]
    
    names.append(r.get(f'film:{film_id}:name').decode())
    years.append(int(r.get(f'film:{film_id}:year')))
    cashs.append(int(r.get(f'film:{film_id}:cash')))
    rates.append(float(r.get(f'film:{film_id}:rate')))

films = {'name': names, 'year': years, 'cash': cashs, 'rate': rates}

films_df = pd.DataFrame.from_dict(films)

In [25]:
films_df

                                   name  year       cash  rate
0                                 Dogma  1999   10000000   7.7
1                            Home Alone  1990   18000000   8.3
2                                 Drive  2011   15000000   7.3
3                                Snatch  2000   10000000   8.5
4                                Clerks  1994      27000   7.7
5  Harry Potter and the Sorcerers Stone  2001  125000000   8.7
6                           Baby Driver  2017   34000000   7.2
7                            Demolition  2015   10000000   7.2
8                    Back to the Future  1985   19000000   8.6
9                             Inception  2010  160000000   8.7

In [26]:
films_df = films_df.sort_values("year")
films_df

                                   name  year       cash  rate
8                    Back to the Future  1985   19000000   8.6
1                            Home Alone  1990   18000000   8.3
4                                Clerks  1994      27000   7.7
0                                 Dogma  1999   10000000   7.7
3                                Snatch  2000   10000000   8.5
5  Harry Potter and the Sorcerers Stone  2001  125000000   8.7
9                             Inception  2010  160000000   8.7
2                                 Drive  2011   15000000   7.3
7                            Demolition  2015   10000000   7.2
6                           Baby Driver  2017   34000000   7.2

In [27]:
films_df = films_df.sort_values("cash", ascending=False)
films_df

                                   name  year       cash  rate
9                             Inception  2010  160000000   8.7
5  Harry Potter and the Sorcerers Stone  2001  125000000   8.7
6                           Baby Driver  2017   34000000   7.2
8                    Back to the Future  1985   19000000   8.6
1                            Home Alone  1990   18000000   8.3
2                                 Drive  2011   15000000   7.3
0                                 Dogma  1999   10000000   7.7
3                                Snatch  2000   10000000   8.5
7                            Demolition  2015   10000000   7.2
4                                Clerks  1994      27000   7.7

### **2. Вывести самый дорогой фильм**

In [43]:
most_expensive_film = films_df.iloc[0]
print(f"Name: {most_expensive_film['name']}, Year: {most_expensive_film['year']}, Cash: {most_expensive_film['cash']}")

Name: Inception, Year: 2010, Cash: 160000000

### **3. Вывести фильмы, чей рейтинг больше 8.5**

In [42]:
for i in range(films_df.shape[0]):
    if films_df.iloc[i]['rate'] > 8.5:
        print(f"- {films_df.iloc[i]['name']}")

- Inception
- Harry Potter and the Sorcerers Stone
- Back to the Future

### **4. Вывести названия фильмов, чей бюджет больше среднего бюджета среди всех фильмов**

In [44]:
mean_cash = np.mean(films_df.loc[:, "cash"])
mean_cash

40102700.0

In [46]:
for i in range(films_df.shape[0]):
    if films_df.iloc[i]['cash'] > mean_cash:
        print(f"- {films_df.iloc[i]['name']}")

- Inception
- Harry Potter and the Sorcerers Stone